// environment


// - дестрибутивы обеспеч наибольшую безопасность
// debian os - на теущий момент максимально детерминирована / обеспеч наибольшую безопасность
// open bsd
// arch linux

// виртуальные машины
// - VMware
// free download https://my.vmware.com/en/web/vmware/free#desktop_end_user_computing/vmware_workstation_player/15_0 (windows, linux)

// - VirtualBox 
// преимущества: позволяет делать снепшоты (снимки полного состояния системы/диска)

// (!) при настройке виртуальных машин (адаптор) рекомендуется включать bridged (режим моста) для возможности просмотра сетевого трафика


// Kali Linux
// дистрибутив на базе debial
// https://ru.wikipedia.org/wiki/Kali_Linux
// в прошлом BackTrack
// предназначен для проведения тестов на безопасность
// идёт с предустановленными инструментами для безопасности, приватности и комп криминалистики
// поддержка архитектуры ARM, регулярные обновления


// список прогр продуктов по кол-ву уязвимотсей
// https://www.cvedetails.com/top-50-products.php?year=0
// чем больше аудитория у системы тем вероятнее имеет большее кол-во експлойтов
// на данный момент ландшафт угроз для линукс минимален по ср с ост системами
// виндоус 10 - минимальный уровень приватности из-за облачной синхронизации (больше иформации по запросу cortana privacy)
// cortana присв рекламный id, собирает персональную информацию, локацию, данные карт, пароли, данные ист браузера, просмотра медиа, вплоть до нажатия клавиш
// disable win tracking утилита для отключения отслеживания пд

// важно настр пиватность, деатльно можно пугуглить fix mac os, fix ubuntu (так же шлёт данные третьи лицам. так же с рекл целями), fix windows (особенно 10 va)
