// social


// важно свести к минимуму раскрытие персональной информации

// информация о том как компании защищают пользователей от правительственных запросов
// https://www.eff.org/who-has-your-back-2018

// (!) везде где возможно нужно вкл двухфакторную аутентиффикацию (касается акков с добавлением персональной информации)

// сервис поиска аккаунтов, для сервисов где контент доступен только для зарегистрированных пользователей
// чтобы минимизировать сбор персональной информации
// http://bugmenot.com/

// (!) если без внесения персональной информации не обойтись, то лучше пользоваться фейковой информацией везде где возможно

// сервис для создания временных имейл адресов для регистрации (больше подходит для ананомности, все присланные пароли необходимо поменять в последствии, тк контент может быть доступен хостинговой компании)
// https://www.guerrillamail.com/

// сервис для верификации по телефону (предоставляет номера)
// иногда лучше купить одноразовый номер (для серьёзной ананимности, возможно в некоторых странах)
// https://www.receive-sms-online.info/

// бёрнеры / одноразовые мобильники - исп для регистрации и никогда больше не используются (включайте бёрнер подальше от дома, желательно в людном месте, правительство отслеживет бёрнеры)

// в дарквебе на форумах можно купить уже вериыъфицированные акки
