// intro


// словарь / основые понятия

// приватность - когда все знают вас и где вы живёте, но не знают чем вы заняты (содержимое имейла)
// ананимность - все видят результат вашей активности, но не знают кто вы
// псевдоананимность - то когда вы желаете сохранить свою репутацию, но не скрыть личность (замена имени логином)
// риск = уязвимости + угрозы + последствия

// (!) никогда не бывает 100% безопасности и нулевого риска

// эшелированная защита
// - предотвращение
// - обнаружение
// - восстановление

// модель нулевого риска - чем меньше доверие, тем меньше риск

// неизвестные баги в по называются уязвимостями нулевого дня
// для известных уязвимостей необходимо уст патчи с обновл по

// для взлома есть уже досупный список эксплойтов (ExploitPackTable, хозяйке на заметку)

// доступ по срвам arc-клиента / us underinternet org (вирусы фор сейл)

// 95% хакеров - script-kitty - хакеры со слабыми навыками, которые умеют только запускать скрипты, написанные кем-то другим


// malware types
// - macro viruses 
// разрабатываются на макро языках / vbs скрипты, могут автоматически запускаться во время открытия документа
// - stealth viruses
// скрывают производимые ими изменения в системе, пытаются перехватить антивирусное по
// - polimorphic viruses
// создают рабочие копии самих себя, составные части могут различаться при каждом новом заражении, что делает очень сложные его прямое обнаружение
// - self-garbling viruses
// самоискажающиеся вирусы, которые искажают свою структуру, чтобы она не совп с сигнатурами антивирусных баз
// - bots & zombies
// группа взломанных устройств под управлением хакера
// - worms
// вирусы которые распр с одной машины на другую
// - OS rootkits
// (соу бэд) внедряются в ядро ос, могут полностью скрывать своё присутсвие
// - firmware rootkits
// руткиты для встроенного по (самый худший вариант из возможных), напр в чип хард диска
// - key loggers
// регистрируют нажате клавиш на устр ввода
// - trojans
// трояны, простые программы которые имитируют опр вид деятельности
// - remote access tools (RAT)
// позволяют получать удалённый доступ к системе, похожи на легальные программы удалённого администрирования
// - ransom wares
// программы-вымогатели, зашифровывают персональные данные, ключ для дешефрования имеется только у хакера (CTB locker, torrent locker)
// - malvertisement
// вредоносная реклама, онлайн реклама со скрытам вредоносным кодом, распространение осуществляется через платформы для продажи рекл баннеров (гугл эдвордс, яху и тд), скрывают выявление через перелинковку
// - drive-by attack
// распр через посещение веб-сайта содержащего код эксплойта

// - spyware 
// носят целью компроментацию приватности/ананимности, без нанесения ущерба

// - adware
// угонщики браузеров, программы для принудительного показа рекламы (coolwebsearch перелинковка, перехват), могут предоставлятся при установки по как дополнительное программное обеспечение
